# EA_DataAccFillUI

## Description
Fills popup with system data.

```pascal
PROCEDURE EA_DataAccFillUI(
				acc      : INTEGER;
				dialogID : INTEGER;
				ctrlID   : INTEGER;
				uiIndex  : INTEGER);
```

```python

def vs.EA_DataAccFillUI(acc, dialogID, ctrlID, uiIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER||
|dialogID|INTEGER||
|ctrlID|INTEGER||
|uiIndex|INTEGER||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library